[
  {
    "title": "[REVIEW] So I switched from Paula’s Choice BHA to CosRX Whitehead Power Liquid",
    "ratio": 0.98,
    "comments": [
      {
        "body": "I also found AHA to give far more impressive results than BHA, even for issues that are classically treated with BHA.\n\nBHA didn't do a damn thing for my SFs on my nose and inner cheeks, but AHA makes them look about 70% smaller!!!!\n\nI still use BHA about twice a week, but I'm wondering whether it's just a waste of time and money. Maybe I need to use it more frequently, but I'm too scared of over exfoliation to try it. \n\nI'm so glad you've found something that makes a dramatic difference - it's so nice (but sadly rare) that it happens!",
        "score": 70
      },
      {
        "body": "AHAs work on top of your skin and take away dead skin more effectively (among other things). BHA (salicylic acid) works deep in the skin to unclog sebum. AHA is water soluble and BHA is oil soluble. \n\nI'm surprised people would even compare these acids. Obviously they need to be used depending on skin needs.\nJust remember that AHA acid makes the skin photosensitive and use of sunscreen is a must, else youll end up with sun damaged skin.",
        "score": 68
      },
      {
        "body": "This is so encouraging! I’m using PC BHA 2% and also found that it’s better than not using it, but still hasn’t given me the effects I hoped for with my hormonal acne. I’m so happy for you!",
        "score": 20
      },
      {
        "body": "that's a different chemical. BHA v AHA. I'm really glad you're having success with AHAs but from your tonality and some of the comments seems like people are interpreting it as a commentary on PC v CosRx? Maybe I'm just being overly defensive of PC lol ",
        "score": 26
      },
      {
        "body": "You switched from a BHA to an AHA. Different acids...",
        "score": 27
      },
      {
        "body": "Yes more love for this product!! Cosrx AHA is the only HG I have so far in my routine! I'm still newish to AB and still looking for another product that actually makes a difference to my skin like this AHA did. Bye bye forehead CC's.",
        "score": 2
      },
      {
        "body": "CosRX BHA and AHA have been a godsend for me. \n\nPaula's Choice introduced me to chemical exfoliants, but they were pretty harsh and for some reason didn't do a whole lot for me (and the smell was abhorrent). Switched to CosRX, especially for the BHA because it's milder on my super sensitive skin. Fell in absolute LOVE. I can almost use it every night, where with PC i had to give my skin at least 3-5 days to recuperate.\n\nSuper glad to hear you found something that's worked for you! I'm a huge fan of Hada Labo Gokujyun Cream as a mositurizer too, really lightweight but still hydrating (no fragrance being the super big bonus here). \n\nEDIT: CosRX whitehead liquid has been the only thing to help with my CCs on my hairline too.",
        "score": 2
      },
      {
        "body": "I used the Power Liquid once  but the next day I woke up to red patches across my cheeks and pimples. I'm worried it's because it says not to mix with vitamin products but nearly EVERYTHING in my arsenal is vitamin infused with the exception of toner, basic moisturiser and sleeping mask (I followed instructions and didn't use any vitamin products but still got red patches). Is it normal for breakouts to occur? And to those who use vitamin products in their daily routine, how do you manage? ",
        "score": 4
      },
      {
        "body": "Hmmm... maybe I’m using the wrong cosrx product. I should try the aha instead of the bha ",
        "score": 1
      },
      {
        "body": "I just bought the PC BHA hoping to get rid of blackheads. After reading your review I'm 100% gonna try the COSRX AHA now. More money down the drain for trying to get better skin. ",
        "score": 1
      },
      {
        "body": "omg that sounds like an absolute dream.. i'm trying to use up my paulas choice bha liquid rn but I can't wait to switch over to AHA!!",
        "score": 1
      },
      {
        "body": "I tried a sample and the Cosrx Whitehead Power Liquid really irritated my skin. Such a shame, I bet it works great!     \nI think it's the pyrus malus fruit water in it. The Mela White Ampoule has it too and irritated my skin as well.",
        "score": 1
      },
      {
        "body": "In My case I dropped cosrx whitehead liquid right away because it gave me acne since the paulas choice never gave me acne ",
        "score": 1
      }
    ]
  },
  {
    "title": "BOJ toner vs Paula’s choice BHA toner",
    "ratio": 0.67,
    "comments": [
      {
        "body": "They're very different toners - why are you comparing them out of curiosity?\n\nA better comparison would be Isntree's 2% BHA Liquid if you're looking for one that is similar",
        "score": 6
      },
      {
        "body": "This very recent thread may be of interest to you https://www.reddit.com/r/AsianBeauty/s/vnbEMGm931",
        "score": 1
      }
    ]
  },
  {
    "title": "AB Substitute for Paula's choice 2% BHA",
    "ratio": 0.95,
    "comments": [
      {
        "body": "For BHA's I think you're better off with american brands honestly, they pack more of that effective punch. I've always used The Ordinary, and when in a pinch good ol' Stridex pads.",
        "score": 54
      },
      {
        "body": "I don't think you'll have any luck with finding 2% salicylic acid, the limit for it in Korea is 0.5%. Most brands like the Cosrx BHA use betaine salicylate to get over this hurdle. It is considered milder and dosen't have as much research behind it as salicylic acid. If I remember correctly 1% salicylic is equivalent to 2% betaine salicylate.",
        "score": 78
      },
      {
        "body": "Interesting that people had bad experiences with Cosrx. I got the PC BHA for my SO, but it caused him to develop an acne cyst and he said it felt too heavy on his skin. I got him the Cosrx BHA as a replacement, which he loves and his skin is baby smooth. My mother, on the other hand, loves the PC BHA. \n\nPerhaps it’s different skin types? My SO is half asian and has oily, acne-prone skin, while my mother is white and has combination, tough skin that can handle intense treatments. And then there’s me who uses neither because my skin is sensitive and dry-leaning.",
        "score": 19
      },
      {
        "body": "Cos De Baha has a BHA liquid and serum. I’ve not used it personally because PC BHA is my HG so I’m not willing to try other brands lol 😅",
        "score": 13
      },
      {
        "body": "The CosRX BHA Blackhead Liquid Power did nothing for my skin. It has a gentler form of BHA, so it isn't an exact dupe. PC is much better in terms of effectiveness. Honestly, PC is expensive but it lasts a long time. \n\nYou can try the Inkey List BHA Toner but this is not AB. It's sold on Sephora's website.",
        "score": 36
      },
      {
        "body": "I disagree with so many of the comments here. PC's did nothing for my blackheads but CosRX worked almost immediately (I.e. saw effects the next morning). I guess it boils down to individual skin concerns, but CosRX is also milder (does not encourage skin dryness) and a lot cheaper.",
        "score": 11
      },
      {
        "body": "Isntree bha toner, it’s not very strong though",
        "score": 12
      },
      {
        "body": "I love Some By Mi AHA BHA PHA 30 Days Miracle Toner. Not everyone on this sub agrees but I notice a real difference. I’m in the US and I order it from oo35mm.com (great indie shop in NYC) or YesStyle. I hated the oily feel of the Paula’s Choice, and Cosrx BHA didn’t seem to do anything for me, so I’m glad to have found this one!",
        "score": 16
      },
      {
        "body": "Oooooo yes I'd like to hear some answers as well! I'm sensitive to butylene glycol so I can't use cosrx, but maybe something else will pop up here that's worthy of a try!",
        "score": 5
      },
      {
        "body": "There are a few options in k-beauty but Korea limits the usage of Salicylic Acid in products (it's 0.05%). So you would not be able to find a dupe but even with 0.05% regular usage can a lot for me without drying the crap out of my skin. Most companies use a derivative which is allowed at a maximum of 4% concentration which is what the cosrx product uses.\n\nSome products with 0.05% Salicylic Acid:\nBonajour BHA eggplant toner\nBe Plain BHA ampoule\nBenton BHA aloe toner\n\n\nThere's also Cos De Bha who use actual salicylic acid but I haven't used them personally.",
        "score": 6
      },
      {
        "body": "I really like the SomeByMi AHA BHA toner it’s so good. Also not a BHA but I highly recommend the Klavuu PHA toner !",
        "score": 5
      },
      {
        "body": "I think Mizon is coming out with their own BSA Blackhead Away Liquid which is meant to be Cosrx's dupe? It has 4% Betaine salisilate in it but not sure if they are shipping out to the US yeat",
        "score": 6
      },
      {
        "body": "Honestly, i havent found a good, strong bha AB product yet. For whatever reason, they’re always too weak to be effective one me. Your best bet, if you really do want to go down the AB beauty route, is to have two items in your routine that has bha.",
        "score": 5
      },
      {
        "body": "Rovectin LHA! I was using the paulas choice BHA but once I found out about the Rovectin one I was really intrigued and decided to try it. \n\nI must say its really nice! Maybe not as strong as the Paulas choice one because its a new derivative, but I like that it's gentle for my sensitive skin and it absorbs super quickly! I'd recommend giving it a go 🙂",
        "score": 9
      },
      {
        "body": "Cos de Baha has a 4% BHA (salicylic acid) Serum while Isntree's Clear Skin BHA Toner is 1% betaine salicylate. Have not tried them yet myself but will likely buy as I've tried other products from these brands and they're pretty good.",
        "score": 3
      },
      {
        "body": "I personally can't handle BHA, so I use Wishtrend's mandelic acid. It works great on my very sensitive skin.",
        "score": 3
      },
      {
        "body": "Isntree 2% Chestnut BHA or Cos de Baha Salicylic liquid is the closest you will get. These have actual salicylic acid (2%) in them and not some natural alternative like the cosrx (I think that is the reason why the Cosrx is not working for many). Also, the formulas are close to the PC one, as they uses propanediol as base too and they are similar in consistency as well.  Generally speaking, most korean products either have 0,5% BHA in them at max, or if they have more, than some other form of BHA is added, which is usually not that effective. This is due to a korean regularion, which says that cosmetic products can have max 0,5 percent of salicylic acid in them. Recently more and more korean brands started to produce products for the west, so thanks to that, the above mentioned products are quite nice dupes for the Black PC BHA Liquid.",
        "score": 3
      },
      {
        "body": "COSRX Blackhead power liquid but its not a dupe, it's better. :p",
        "score": 11
      },
      {
        "body": "**Benton Aloe BHA Toner.** \n\nI tried the Cosrx BHA but didn't notice any difference. I was using the Benton one because it is gentle so I can use it every day. Just 1-2 weeks later I noticed the blackheads on my nose disappeared and they \bhave been there like forever.",
        "score": 2
      },
      {
        "body": "I found the purito bha gel really good :)",
        "score": 1
      },
      {
        "body": "You're better off with an american brand. Try looking into naturium's 2% salycilic acid liquid exfoliant",
        "score": 1
      }
    ]
  },
  {
    "title": "ISO toners pads that are similar to Paula’s Choice BHA Liquid Exfoliant",
    "ratio": 0.9,
    "comments": [
      {
        "body": "Isntree's Chesnut BHA Liquid! Peach Slice's also has one",
        "score": 3
      }
    ]
  },
  {
    "title": "Has anyone found an AB aha/bha better than the paula's choice line?",
    "ratio": 0.98,
    "comments": [
      {
        "body": "Non-AB alternatives: \n\n* Silk Natural 8% AHA, lactic acid\n\n* PTR 10% Glycolic Moisturizer (cream, time-released) \n\n* PTR 10% Glycolic Gel (not time released) \n\n* Alpha Hydrox line - AHA, glycolic \n\n* Biologique Recherche P50 (and alternative formulas) lotion - AHA\n\n* St. Ives pads (discontinued) AHA, lactic acid (3-4% I think) \n\n* Nip + Fab pads AHA, glycolic (2-4% I think) \n\n* FAB Facial Radiance Pads AHA, lactic & glycolic\n\n* Stridex BHA (red box) BHA I believe?\n\n* [re]fresh peel AHA lactic and fruit acid \n\n* REN Resurfacing AHA concentrate, lactic & glycolic\n\n* Dr. Dennis Gross Alpha Beta Peel (regular and \"extra strength\")\n\n* philosophy \"hope in a jar\" range, (day/night creams, 'renewed hope' as well)\n\n* Alpha-H Liquid Gold serum AHA, glycolic\n \nI learned about all of these options through a mix of research including Skin and Tonics's blog and PC's beautypedia \"AHA\" search function. I chose the \"top rated\" products on beautypedia, read reviews, reviewed ingredients (especially active ingredient percentages) then cross-checked reviews there and on reddit with makeupalley and cosdna.\n\nSharing info here - I obviously don't use all of these, but I have tried several. YMMV, as always. Most of them are over priced and some of them are decent. I'm still researching AB for a decent glycolic acid based AHA (I'm allergic to NSAIDs so BHAs are a no no for me and lactic acid makes my skin red and rubbery [insert 50 Shades joke here]). \n\nI'm currently using the PTR 10% cream because Alpha Hydrox can't get their act together and sell in Canada. I think it's the only skin product I've ever liked that came from Sephora. As soon as I'm finished this tube of PTR I'm going to load up on Alpha Hydrox, so don't be fooled by my 'expensive' choice - it works for me and is what I currently have in my vanity.\n\nI'm all about choosing more affordable products and am an ingredient and packaging hound. I wouldn't personally buy any \"active\" product in a tub because I think that oxidization plays a big role in product efficacy and longevity. Tubes and pumps > tubs. \n\nIt's not that I'm against PC, but I haven't bought any of her products yet because I think there are still more affordable alternatives that work \"as well, if not better\" than her line. Especially when I read her reviews and see the obvious bias, I have to wonder...\n\nEdit - spelling, grammar and product additions",
        "score": 22
      },
      {
        "body": "As far as I recall AB brands aren't that strong in AHAs and BHA products, although they tend to do better at other things (eg light textured lotions, sunscreens, sheet masks, \"exotic\" ingredients, and so on). Maybe someone else can come up with a rec, but by and large most mainstream ab brands I've encountered don't really carry aha or BHA products, and when they do, the formula is usually not as great as those from western brands.",
        "score": 10
      },
      {
        "body": "COSRx and Mizon are the only companies that I know of that have AHA and BHA products.",
        "score": 12
      },
      {
        "body": "Mizon's AHA 8% peeling serum and their AHA & BHA Daily Clean Toner are the only ones I've heard of. I think Hada Labo includes AHA and BHAs in some products but not as effective exfoliants.\n\nI'd love to find an alternative to Paula's Choice who sketch me out a little.",
        "score": 14
      },
      {
        "body": "So I used the PC AHA for almost a year and thought it was fine, though I don't think I really noticed much change one way or another. Switched to the CosRX AHA 7 Whitehead Power Liquid (7% glycolic acid) on a whim, and even though it has 1% less glycolic acid than the PC, I've actually found it to be noticeably more effective. My skin started to feel super silky and smooth very quickly after introducing it, and I got one short-lived purge zit (figuring it's a purge because I always get grits from that area, so there are little plugs there that are usually not visible). Never purged even a bit from the PC AHA. I have their BHA liquid and A-Sol coming to me if customs would ever feckin' release them already.\n\nCosRX AHA does smell a ton worse than even PC products, though :p",
        "score": 5
      },
      {
        "body": "Honestly, PC's acids are some of the best in the business. They get excellent reviews even from individuals who don't care for Paula Begoun or her approach, including Caroline Hirons. P50 is another HG-level acid, and I think you'll be hard pressed to find anything from AB that will measure up. I know some people really like the CosRx, but from where I'm sitting, the ingredient list doesn't beat out BR or PC. Another Western alternative is looking at Make Up Artist's Choice. They don't have interchangeable offerings necessarily, but they have very well formulated acid products at a very affordable price point. ",
        "score": 6
      },
      {
        "body": "i don't think you're really gonna find much except what's already been recommended. Korea has regulations against using certain amounts of acids so you're not going to find products strong enough as PC or other western brands. It's just what it is",
        "score": 7
      },
      {
        "body": "For the Glow Tonic, a similar product would be the COSRX AHA/BHA Clarifying Treatment Toner. I tried it myself for about 2 months and to be totally honest I didn't notice any particular differences between them. So I guess it could either be that the COSRX works similar to the Glow Tonic or neither of them work much at all. But if you're looking for a P50 dupe, there isn't really an Asian equivalent.  \n\nI personally choose to carry on using the Pixi because it's easily accessible for me in the UK (and I have a friend who works in Liberty so I get a discount and it works out about the same). ",
        "score": 3
      }
    ]
  }
]