[
  {
    "title": "Is the skin1004 Madagascar Centella Ampoule Foam supposed to be used on its own or can it be used as second cleansing after the (Madagascar Centella Light) Cleansing Oil?",
    "ratio": 1.0,
    "comments": []
  },
  {
    "title": "Product Review: Madagascar Centella Tea-Trica BHA Foam by Skin1004",
    "ratio": 1.0,
    "comments": []
  },
  {
    "title": "Looking for a perfume or lotion that smells like the Skin1004 Cleaning Oil",
    "ratio": 1.0,
    "comments": [
      {
        "body": "I have no direct suggestion, but I can tell you that the smell of this oil reminds me of Earl Grey tea! Which actually makes sense, since on the Skin1004 their ingredient list states \"Citrus Aurantium Bergamia (Bergamot) Fruit Oil\".\n\nIf you're looking for a perfume, you could try [this search](https://www.fragrantica.com/ingredients-search/), where you can add or exclude certain components!\n\n[Full INCIs here](https://skin1004.com/products/skin1004-madagascar-centella-light-cleansing-oil), but I personally only smell the bergamot.",
        "score": 3
      }
    ]
  },
  {
    "title": "Skin1004 Madagascar Centella Light Cleansing Oil, have you guys used it before? Is it better a good cleansing oil for your double cleansing routine?",
    "ratio": 0.98,
    "comments": [
      {
        "body": "Her review is spot on, shes right about how its good enough to use on its own without a gel/foam cleanser as double cleansing. But, I still have this icky feeling after using oils lol so I stick with double cleansing lol. Thanks for sharing the link 💕",
        "score": 19
      },
      {
        "body": "hi! ive been eyeing this product for a VERYYYY long time now and i still have some hesitations cause apparently it has a fragrance in it? i have a combo sensitive skin and i need help whether this can break me out or not? PLEASE HELP ME i need a good oil cleanser for my skin type so bad 😭",
        "score": 6
      },
      {
        "body": "Lab Muffin literally released a video about this yesterday :)\n\nhttps://youtu.be/uL54E_kxReA",
        "score": 9
      },
      {
        "body": "Is this better than the Kose softymo speedy cleansing oil?",
        "score": 3
      },
      {
        "body": "I don't use any makeup should I add cleansing oil into my routine ???",
        "score": 2
      }
    ]
  },
  {
    "title": "Review of items that were popularly recommended: Kose Cleansing Oil, Isntree Watery Sun Gel, Pyunkang Yul Essence Toner, Olive Young Pimple Patches + more including MISSHA Cushion No. 21N Vanilla Swatch",
    "ratio": 0.98,
    "comments": []
  }
]