[
  {
    "title": "[Product Question] What are your thoughts on The Ordinary's Niacinamide Serum?",
    "ratio": 0.89,
    "comments": [
      {
        "body": "TO'S was the first niacinamide serum I tried, and I ended up giving it to my cousin cause I didn't notice any difference in my skin. I thought maybe it just wasn't a product I needed. I decided to give it another try some time later and picked up Good Molecules niacinamide serum and it was way better. I was less oily and my pores weren't so noticeable (I got big ones lol). Between that and their HA serum my skin has been smooth And dewy!",
        "score": 4
      },
      {
        "body": "Yes I agree, it either works for you or doesn’t so it can be a divisive product and you won’t know until you try.\n\nPersonally it was a positive for my skin, but I also don’t feel the need to get a dedicated niacinamide product because it’s in so many products these days, I’d rather have a multi functional step that has niacinamide and other actives",
        "score": 3
      },
      {
        "body": "Natrium has a good niacinamide serum that’s very affordable.",
        "score": 2
      },
      {
        "body": "I realize this is a 5 month old post, but have you tried it and did you like it? \nIve been using TO niacinamide for about 3 months, missing a day here and there. I never got the breakouts that other people have from it. \nMy only complaint is that a lot of people say it is on the hydrating side, but it does make my skin feel dry and tight so i follow it up with a thick layer of hylauronic acid moisturizer. \nI havent noticed a change in my hyperpigmentation, but my hyperpigmentation is years old and probably needs something stronger. \nI have noticed that my pores look smaller and less obvious, which is why i keep using it. My pores, especially on and around my nose, have been a major insecure point for me for years. \nHows it treating you?",
        "score": 1
      }
    ]
  },
  {
    "title": "[Skin Concern] The Ordinary Niacinamide 10% is burning my skin",
    "ratio": 0.83,
    "comments": [
      {
        "body": "The Ordinary’s percentage is too high and that’s why it has the tendency to be aggravating to skin. Dermatologists suggest products with only 2-5% niacinamide.",
        "score": 42
      },
      {
        "body": "I mix it with a moisturizer that doesn’t have any niacinamide! It works great, one or two drops at most and my skin is satin.",
        "score": 12
      },
      {
        "body": "I mix mine with TO hyaluronic acid, 2 drops of each. I found the niacinamide by itself gave me dry, red skin around my nose and mouth.",
        "score": 6
      },
      {
        "body": "The mixing that others have suggested is a great idea. \n\nI just wanted to add that some products sting on the upper part of my cheek (near my eyes) because my skin there is thinner and more sensitive and if this is what is happening to you I would suggest putting on some vaseline or cerave moisturizing cream or Aquaphor on the skin around your eyes and then continue with your routine.",
        "score": 2
      },
      {
        "body": "I had a bad reaction starting this product too. I’ve found 2 drops for my whole face and neck is tolerated better, or mixing it with moisturizer as suggested by others!",
        "score": 2
      },
      {
        "body": "I had this experience but with the caffeine eye serum instead this morning. Gosh that was the most pain experience ever, I’ve been able to put everything else around my eyes but the one thing that is supposed to go there",
        "score": 2
      },
      {
        "body": "Niacinamide in high concentrations can irritate the skin - I use the same product but only apply it twice or three times a week which got rid of my irritation",
        "score": 2
      },
      {
        "body": "Do not use it. It’s too strong for you. \n\nI can’t use anything with more than like 5% niacinamide otherwise my face burns and turns bright red. \n\nMaybe try using it on your body?",
        "score": 2
      },
      {
        "body": "Just use less, when I started with this product I couldn’t use a full dropper so I started using less and then it was fine, now my skin can tolerate it better but I moved on to other products containing this ingredient instead since I liked it but never loved it. I feel like this is super common with this product.",
        "score": 2
      },
      {
        "body": "My revolution skincare Niacinamide and zinc serum does this too. I skipped it today and no redness. Niacinamide is known to cause cheek flushing",
        "score": 1
      },
      {
        "body": "i cant even tolerate the 4% niacinamide in cerave pm moisturizer...i have the 10% TO but im not even gonna try it.",
        "score": 1
      }
    ]
  },
  {
    "title": "[Product question] the ordinary niacinamide - recommend or horror story??",
    "ratio": 0.84,
    "comments": [
      {
        "body": "I broke out in CCs across my forehead massively the first time I used TO Niacinamide and assumed it just wasn't for me. But I've started using it again for the past month, starting out with a drop every night under my moisturiser and building up.  I've had no breakouts and I can see a big difference. I think introducing it slowly and giving your skin time to get used to it is key!",
        "score": 25
      },
      {
        "body": "Always patch test before applying the product to the whole face as the breakouts varies from person to person so it's not something that 100% guarantee for you. \n\nNiacinamide is quite a well rounder since it can increase ceramide synthesis, aid in decreasing PIH / PIE, reducing sebum production. You might want to try another brand that contains Niacinamide if you feel that the TO Niacinamide might break you out.",
        "score": 8
      },
      {
        "body": "I love TO niacinamide. It's supposed to help controlling sebum production and fade PIE/PIH. It really helps me with my hyperpigmentation. I didn't get any breakouts from using it.",
        "score": 6
      },
      {
        "body": "It’s helped even out my combo skin.. my forehead used to be like an oil slick at the end of the day, but niacinamide put a stop to that.",
        "score": 4
      },
      {
        "body": "Everything breaks me out, and I’m using the Paula’s Choice 20% niacinamide with no breakouts! It seems to be gentle enough, no redness or peeling or anything.",
        "score": 3
      },
      {
        "body": "I started using it this week and it broke me out. Mainly around the nose, very flaky/dry with lots of whiteheads. I don't want to give up and waste it though :( So I started trying it once a day instead of twice and avoiding my nose area and hoping it will be better after a while and my skin can get used to it.. I'm not sure if it's the niacinamide or zinc causing breakouts. But I have read experiences where it got better after a few weeks, so I'll try it another month and see from there.",
        "score": 1
      },
      {
        "body": "i'm using [niacinamide](https://theordinaryreviews.com/the-ordinary-niacinamide-review/) couple of days and it give me best result as expected.",
        "score": 1
      },
      {
        "body": "I have sensitive skin and I have had no bad issues with it at all. I was expecting a purge, but there was nothing. I don't have oily skin, except for my T-zone or generally get a lot of spots or pimples so that might be something to do with it.   \nI saw instant positive results. Blackheads and sebaceous filaments are disappearing, pores appear smaller and my skin looks much brighter and healthier.   \nI am using it with their lactic acid exfoliator a couple of times a week too and just cleanse and moisturise as normal otherwise (not with anything fancy).   \n\n\nEveryone's skin is different, obviously, but I could not recommend this enough for treating oily  skin and blackheads etc.",
        "score": 1
      }
    ]
  },
  {
    "title": "Best & Worst Skincare Products I’ve tried [review]",
    "ratio": 0.99,
    "comments": [
      {
        "body": "Not Future Dew Not 😂😂😂 \n\nI’m obsessed with this. I love finding someone who hates the same things I do! Please do this annually this is amazing, holy shit",
        "score": 1310
      },
      {
        "body": "OP we need more posts like this. The nicknames alone 😂",
        "score": 120
      },
      {
        "body": "This 👏 is 👏 amazing 👏 more please",
        "score": 94
      },
      {
        "body": "I love how you’ve done this 10/10",
        "score": 14
      },
      {
        "body": ">15.   **Murmure Bisou Clarifying Dry Oil – 10/10**  \n*Pros:* Cleared my blackheads, sinks into the skin fast.  \n*Cons:* Contains hazelnut oil so be careful if you have an allergy!  \n*Bottom Line*: I use it about 2x a week at night (not on the same day as my retinol). My skin is always less red and bumpy in the AM.\n\nI'm really curious about this. I've always described my nose as a \"strawberry\" due to how many blackheads I can get. Thanks for your review!",
        "score": 6
      },
      {
        "body": "My god this is the best post I’ve ever seen on this subreddit. I am definitely being dramatic but you have the same skin type as me and I felt some of these names so deeply thank you!!\n\nEdit: thank you for your skincare service I have new moisturizers to try",
        "score": 5
      },
      {
        "body": "As an inexperienced skin care consumer/trying to figure this out…this is gold.",
        "score": 4
      },
      {
        "body": "The visuals layout and your breif descriptors on the pictograms are entertaining, direct, and informational. \n\nAbsolutely love this presentation. Thanks for trying a bunch of questionable products on your skin so we don't have to.",
        "score": 4
      },
      {
        "body": "Wow you your skin type is exactlyyyyyy like mine!!!! Mine is super sensitive & terribly acne prone! I had a few questions for you if thats alright - so the la Roche posay anthelios sunscreen, you say it's the European version, that's not a mineral sunscreen is it?  Where did you buy it? And did it make ur face look dry after a few hours? I currently use the LRP mineral spf and have such a love hate relationship with it lol, its my ole reliable but I've been dying to switch to something else. Also with the CE Ferlic serum how long did it take u to see results??? I've been wanting to try that one too but the price scares me LOL,  I love this list u compiled it's very helpful!!!!!!",
        "score": 3
      },
      {
        "body": "this post is top tier quality, bravo OP. Damn skinfix pricey though but you might just make me try it\n\nAlso, I agree, the Langiene lip mask is over fuckin’ rated and idk what the hype is about. Personally I like nuxes honey one is bomb, rose one surprisingly sucks. I like the Jack black one too…the honey one…hmmm…pattern detected \n\nKeep being exactly who you are",
        "score": 3
      },
      {
        "body": "I love the format of this review. 😄\nI had so much fomo of laneige lip mask and saw so many raves about it idk why! Thanks for the honest reviews!",
        "score": 2
      },
      {
        "body": "Is the A313 better than tretinoin? I have such sensitive skin but everyone on tiktok using this product has beautiful results and I am not seeing beautiful skin from tret.",
        "score": 2
      },
      {
        "body": "Love this!!!! 🤣🤣🤣🤣🤣😤🤣",
        "score": 2
      },
      {
        "body": "Love this ! Thank you for saving my money. Seems like a lot of work and would love to see you continue this 👍👍",
        "score": 2
      },
      {
        "body": "The names are sending me over the edge. This is amazing.",
        "score": 2
      },
      {
        "body": "I’m impressed with all the work you put into this- love it! Thanks for posting your reviews",
        "score": 2
      },
      {
        "body": "This is the best and most helpful review I’ve ever seen. I love that I don’t feel alone that I try so many recommended products and hate the majority!",
        "score": 2
      },
      {
        "body": "Ha, love this! Thanks for sharing. I’m curious about the A313 Vitamin A Pommade and Murmure Bisou Clarifying Dry Oil — when you apply those do you do it on top of moisturizer? Or do they replace your moisturizer?",
        "score": 2
      },
      {
        "body": "This review, 10/10.",
        "score": 2
      },
      {
        "body": "Thanks for writing this up! May I ask where you purchased the A313 and the Anthelios Euro version? Thanks!",
        "score": 1
      },
      {
        "body": "Your YTTP mask might have been old. I have an old jar currently and would describe it how you said here, but it started out creamy and spread nicely.\n\n\nI loved the Skin Fix moisturizer, until I started to have an allergic reaction to just about everything and had to stop using it (along with the cleanser and eye cream 😩). \n\n\nThe Ordinary squalene cleanser also made me itchy, and the Toleriane moisturizers burn me...but the Toleriane Dermo-Cleanser is great for me. \n\n\nInteresting to see how many of these I agree with, but my skin is just over the top reactive since 2022 so almost everything is itchy, burny, drying hell. But my skin is dry so I need *something*. ",
        "score": 1
      },
      {
        "body": "I’m so sad that products work differently for different people because I’d much rather just go with your recommendations than trying things myself. I’d say 80% of this is accurate for me though and that’s pretty dang good!",
        "score": 1
      },
      {
        "body": "Finally a hilarious and helpful post on this sub",
        "score": 1
      },
      {
        "body": "WATER FROM THE 90s lmaooooo but seriously great list I agree with so much of this!",
        "score": 1
      },
      {
        "body": "This is amazing 😂",
        "score": 1
      },
      {
        "body": "The names you came up with!!! Cracks me up!!! Love this post 💕",
        "score": 1
      },
      {
        "body": "I like the way you laid this information out 👏",
        "score": 1
      },
      {
        "body": "Following. Thank you for this post",
        "score": 1
      },
      {
        "body": "Aquaphor is my favorite thing in the world. Works like magic on my skin. I'm sad that the Mario Badescu spray was ranked so low... I adore that stuff and find that it gives me that dewy, hydrated look. To each their own! This is a great review, though. Thanks for putting it all together!",
        "score": 1
      },
      {
        "body": "This was pure joy to read. Thank you! Great format, honest, and hilarious",
        "score": 1
      },
      {
        "body": "This made my day. Thank you for the honesty and comedy.",
        "score": 1
      },
      {
        "body": "love this review! pls pls pls do it with makeup products!",
        "score": 1
      },
      {
        "body": "Love this list. The LRP double repair without spf is great, does not break me out. The Clinique moisture surge spf 28 is wonderful for my sensitive skin and eyes. No cast, fragrance free but somehow still smells a little like sunscreen, not sure. And for lips nothing beats babe glow sleeping mask. Fragrance free, not too expensive, beautiful packaging (in glass pot) bought it like three times. Use it under Vaseline.",
        "score": 1
      },
      {
        "body": "I love posts like this",
        "score": 1
      },
      {
        "body": "Thanks for your reviews! I’m picking up the LRP cicaplast. I get the worst eyelid rash, and kids get horrible round the nose from all the tissues in cold season. \nI’ve been given different creams for the dermatologist that work, but in Canada I’m waiting 6+ months to get an appointment!!\n🤞 this works for us",
        "score": 1
      },
      {
        "body": "Thanks for doing this !",
        "score": 1
      },
      {
        "body": "We have identical skin!!  Please tell me your favorite cleansers! I can’t find any that are moisturizing and don’t break me out!  ( I use LRP Dermo cleanser but feel it clogs my chin area.)\n\nlove this!",
        "score": 1
      },
      {
        "body": "I need more of this!",
        "score": 1
      },
      {
        "body": "FINALLY someone else who didn’t like the U Beauty lip compound. I had gotten a sample and really liked it, splurged on a tube and was like, “Is this the same product?! People LIKE this?”",
        "score": 1
      },
      {
        "body": "Lol my friend gifted me a 95% full Glossier Milky Jelly Cleanser (after her friend gave it to her). It was like an endless cycle of \"please take this garbage from me!!!\"...needless to say, I threw it out after 2 uses xD\n\nCouldn't agree more on the 0/10. Honestly, I do not get the hype for this brand.",
        "score": 1
      },
      {
        "body": "Laughed so hard at this! Thank you for the effort 🤣",
        "score": 1
      },
      {
        "body": "Awesome. Love this. Especially where you note \"burning\" because that happens to me a LOT. \n\nDefinitely going to put your picks to the test. But also, disagree on the Caudalie- that spray is amazing after washing your face and if you can keep it in the fridge, it's like all seven layers of heaven on a hot day. Pro tip: rub it in, don't just let it dry.",
        "score": 1
      },
      {
        "body": "thank you! this review was amazing and helpful!",
        "score": 1
      },
      {
        "body": "this is amazing and hilarious. thanks!",
        "score": 1
      },
      {
        "body": "Thank you so much for this.",
        "score": 1
      },
      {
        "body": "Why did you name ordinary itchy cleanser? I’ve been using their products in my regimen but I’ve gotten a few itchy spots but I never knew where they came from…",
        "score": 1
      },
      {
        "body": "Absolutely love this rating scale lmao",
        "score": 1
      },
      {
        "body": "i love u for this !! amazing captions too hahaha",
        "score": 1
      },
      {
        "body": "Thank you for making this! I spend too much time digging for product reviews hoping they aren’t paid for.",
        "score": 1
      },
      {
        "body": "I need a Kiehls version of this!! 😭🩷",
        "score": 1
      },
      {
        "body": "I loved this post sm I couldve scrolled forever",
        "score": 1
      },
      {
        "body": "Itsounds like we have very similar skin, and I really appreciate the time you took to write out this review, thank you! 🫶🏽\n\nDo you (or anyone with similar skin) have experience with any of these sunscreens?\n\t•Anthelios Mineral Tinted Ultra-Light Face Sunscreen Fluid SPF 50\n\t•Anthelios Tinted Ultra-Light Fluid Mineral Face Sunscreen SPF 50\n\t•Anthelios Mineral Zinc Oxide Sunscreen SPF 50\n\nI looked up the one you suggested because it’s you mentioned it doesn’t leave a white cast, but from what I’ve read, it seems to leave an oily or dewy finish - which I’m not a fan of in sunscreens. & These were said to be a non oily alternative with a matte finish but would love to hear anyone’s feedback in advance, thank you so much! 😊",
        "score": 1
      },
      {
        "body": "1 and 4 are my HGs!!!!! I am so shocked by this",
        "score": 1
      },
      {
        "body": "Wow, thanks for putting this together!!",
        "score": 1
      },
      {
        "body": "PLS SPRAY AND PRAY BAHAHAHA \njokes aside i rly appreciate this as i have the exact same problematic skin type 😭",
        "score": 1
      },
      {
        "body": "absolutely love this review format, neeeed more of them. I’m a similar age and have the same skin type as you, this was so helpful!",
        "score": 1
      },
      {
        "body": "You should try Good Moleules, it's a different version of the ordinary brand and I love it",
        "score": 1
      },
      {
        "body": "I thought i was the only one who was itchy with TO squalane cleanser! Glad to know i’m not the only one. \nWill try skinfix triple lipid. I skin needs some extra moisture this winter. Seems to be drier than usual. \n\nLove the way you gave each product a name. Very innovative and entertaining. Please do this often! 🤣🤣🤣",
        "score": 1
      },
      {
        "body": "Not even surprised that the cheapest in this list (Aquaphor) got a 10/10. I've been using it for years and it's always saved my (literal) hide. It's a classic.",
        "score": 1
      },
      {
        "body": "What a great list you have shared! I am personally a fan the Ordinary I have dry sensitive skin and their squalene with 5% retinol works great for me! Let me know if you have any other recommendations for my skin type!",
        "score": 1
      },
      {
        "body": "Commenting to come back to this",
        "score": 1
      },
      {
        "body": "I appreciate the effort put into this and the info, but aren't posts like these useless? I mean everybody responds to every product differently and what is a 10/10 for you is horrendous for somebody else...",
        "score": 0
      }
    ]
  },
  {
    "title": "[Routine Help] The Ordinary Niacinamide 10% causing skin tingling after applying CeraVe moisturiser ",
    "ratio": 1.0,
    "comments": []
  }
]
